USE SalesOrders;
GO

/*1. В яких містах живуть наші клієнти?*/

GO

/*2. Показати поточний список наших працівників і номери їхніх телефонів.*/

GO

/*3. Продукти яких категорій ми пропонуємо в даний момент часу?*/

GO

/*4. Як називаються і скільки коштують продукти котрі ми перевозимо і до якої категорії вони відносяться.*/

GO

/*5. Показати список імен поставщиків в порядку поштових індексів.*/

GO

/*6. Показати список працівників разом з їхніми телефонами і ідентифікаційними номерами і відсортувати його по прізвищах і іменах.*/

GO

/*7. Показати імена всіх поставщиків.*/

GO

/*8. В яких штатах знаходяться наші клієнти?*/

GO

/*9. Як називаються і скільки коштують товари, котрими ми торгуємо?*/

GO

/*10. Показати всю інформацію про наших співробітниках.*/

GO

/*11. Показати в алфавітному порядку список міст в котрих є наші поставщики і включити в нього імена всіх поставщиків, з якими ми працюємо в кожному місті.*/

GO

/*12. Скільки днів потрібно для доставки кожного замовлення?*/

GO

/*13. Яка вартість запасів кожного товару*/

GO

/*14. Скільки днів пройшло від дати замовлення до дати поставки кожного замовлення?*/

GO

/*15. Виведіть одним запитом список натуральних чисел від 1 до 10 000.*/

GO

/*16. Порахуйте запитом скільки субот і неділь в поточному році.*/

GO